//Перегрузка оператора индексирования . Перегрузка операторов пример. C++ Для начинающих. Урок#87 - Видео №18.

#include<iostream>
using namespace std;

//Реализация работы массива в ООП, в классе.
//------------------------------------------------------------------------------------
class TestClass
{
public:
	int &operator[](int index) //Убрпав знак (&) у operator, мы не сможем менять значения в ячейках массива.
	{
		return arr[index];
	}

private:
	int arr[5]{ 5,68,4,6,348 };
};
//------------------------------------------------------------------------------------
int main()
{
	setlocale(LC_ALL, "ru");

	TestClass a;

	cout << "=======================================================================" << endl;
	cout << "Смотрим, какое значение у нас лежит в ячейке под индексом [0], и это - " << a[0] << endl;
	cout << "=======================================================================" << endl << endl;

	cout << "=======================================================================" << endl;
	a[0] = 100;
	cout << "Заменяем в ячейке под индексом [0] значение 5 на 100, и теперь в ячейке под индексом [0] значение - " << a[0] << endl;
	cout << "=======================================================================" << endl << endl;

	cout << "=======================================================================" << endl;
	cout << "Смотрим, какое значение у нас лежит в ячейке под индексом [3], и это - " << a[3] << endl;
	cout << "=======================================================================" << endl << endl;

	cout << "=======================================================================" << endl;
	a[3] = 77;
	cout << "Заменяем в ячейке под индексом [0] значение 6 на 77, и теперь в ячейке под индексом [3] значение - " << a[3] << endl;
	cout << "=======================================================================" << endl;

	return 0;
}
//------------------------------------------------------------------------------------